In [1]:
import numpy as np          #import numpy librabary

In [2]:
import pandas as pd         #import pandas librabary

# Pandas series

- It is a one-dimentional(1D) array holding data of any type.
- A Pandas series is like a coloum in a table

1. **Pandas series can be creatad using List**

In [7]:
import pandas as pd         #import pandas librabary

In [8]:
l=[1,2,3]
s= pd.Series(l)
print(s)

0    1
1    2
2    3
dtype: int64

In [9]:
type(s)

pandas.core.series.Series

In [10]:
s.shape

(3,)

In [11]:
l=[1,2,3]
s= pd.Series(l,index=["a","B","c"])
print(s)

a    1
B    2
c    3
dtype: int64

2.**Create series using 1D Array**

In [12]:
import numpy as np

In [13]:
a = np.array([1,2,3])
s=pd.Series(a)
print(s)

0    1
1    2
2    3
dtype: int32

In [14]:
a = np.array([1,2,3])
s=pd.Series(a,index=['a','b','c'])
print(s)

a    1
b    2
c    3
dtype: int32

3.**Create a Series using Dictionary**

In [15]:
d={"n":23,"a":27,"g":83,"a1":74}
s=pd.Series(d)
print(s)

n     23
a     27
g     83
a1    74
dtype: int64

# Pandas DataFrame

- A Panads data frame is a 2  dimensional data struture, like a 2 dimensional array, or a table with rows and coloums.

1. **Create DataFrame using Dictionary**

In [16]:
d={'naga':[4,5],'arjun':[6,5]}
a=pd.Series(d)
print(a)

naga     [4, 5]
arjun    [6, 5]
dtype: object

In [17]:
d={'naga':[4,5],'arjun':[6,5]}
df=pd.DataFrame(d)
print(df)

   naga  arjun
0     4      6
1     5      5

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df.shape

(2, 2)

2. **Create DataFrame using Nested List**

In [20]:
data = [[1,2,3],[4,5,6]]
df1=pd.DataFrame(data,columns=['a','b','c'])
df1

   a  b  c
0  1  2  3
1  4  5  6

3. **Create DataFrame using 2D array**

In [21]:
a2d=np.array([[1,2,3],[4,5,6]])
df2=pd.DataFrame(a2d,index=['a','b'],columns=['n','a','g'])
df2

   n  a  g
a  1  2  3
b  4  5  6

# Pandas

In [22]:
df = pd.DataFrame({"Age":[22,30,23,25,24],
                   "Salary":[28000,17000,46000,42000,55000],
                   "Gender":['M','F','M','M','F']})
df

   Age  Salary Gender
0   22   28000      M
1   30   17000      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

In [26]:
df1=df.set_index("Age")
df1

     Salary Gender
Age
22    28000      M
30    17000      F
23    46000      M
25    42000      M
24    55000      F

**reset index**

In [25]:
df1.reset_index()

   Age  Salary Gender
0   22   28000      M
1   30   17000      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

**Drop a single row**

In [34]:
df1 = df.drop(index=0)
df1

   Age  Salary Gender
1   30   17000      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

In [35]:
df1 = df.drop(index=1)
df1

   Age  Salary Gender
0   22   28000      M
2   23   46000      M
3   25   42000      M
4   24   55000      F

**Drop multiple rows**

In [37]:
df1 = df.drop(index=[0,3,4])
df1

   Age  Salary Gender
1   30   17000      F
2   23   46000      M

**Drop a single column**

In [39]:
df1 = df.drop(columns=["Age"])
df1

   Salary Gender
0   28000      M
1   17000      F
2   46000      M
3   42000      M
4   55000      F

In [40]:
df1 = df.drop(columns=["Gender"])
df1

   Age  Salary
0   22   28000
1   30   17000
2   23   46000
3   25   42000
4   24   55000

In [41]:
df1 = df.drop(columns=["Salary"])
df1

   Age Gender
0   22      M
1   30      F
2   23      M
3   25      M
4   24      F

**Drop multiple columns**

In [45]:
df

   Age  Salary Gender
0   22   28000      M
1   30   17000      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

In [48]:
df1 = df.drop(columns=["Age","Salary"])
df1

  Gender
0      M
1      F
2      M
3      M
4      F

In [49]:
df1 = df.drop(columns=["Age","Gender"])
df1

   Salary
0   28000
1   17000
2   46000
3   42000
4   55000

In [62]:
df = pd.DataFrame({"Age":[22,30,23,25,24],
                   "Salary":[28000,17000,46000,42000,55000],
                   "Gender":['M','F','M','M','F']})
df

   Age  Salary Gender
0   22   28000      M
1   30   17000      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

**Sorting value in a dataFrame**

In [63]:
#Sorting in asending order
df.sort_values(by="Age",ascending=True)

   Age  Salary Gender
0   22   28000      M
2   23   46000      M
4   24   55000      F
3   25   42000      M
1   30   17000      F

In [66]:
#Sorting in asending order
df.sort_values(by="Gender",ascending=True)

   Age  Salary Gender
1   30   17000      F
4   24   55000      F
0   22   28000      M
2   23   46000      M
3   25   42000      M

In [67]:
#Sorting in asending order
df.sort_values(by="Salary",ascending=True)

   Age  Salary Gender
1   30   17000      F
0   22   28000      M
3   25   42000      M
2   23   46000      M
4   24   55000      F

In [65]:
#Sorting in descending order
df.sort_values(by="Age",ascending=False)

   Age  Salary Gender
1   30   17000      F
3   25   42000      M
4   24   55000      F
2   23   46000      M
0   22   28000      M

**Combining Dataframes**

In [73]:
df1=pd.DataFrame({"city":["mumbai","delhi","banglore","hyderbad"],"temparature":[32,45,40,36]})
df1

       city  temparature
0    mumbai           32
1     delhi           45
2  banglore           40
3  hyderbad           36

In [74]:
df2=pd.DataFrame({"city":["delhi","mumbai","banglore","chenai"],"humidity":[68,65,75,70]})
df2

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75
3    chenai        70

**concatination**

In [77]:
import pandas as pd         #import pandas librabary

In [83]:
pd.concat([df1,df2],axis=0)

       city  temparature  humidity
0    mumbai         32.0       NaN
1     delhi         45.0       NaN
2  banglore         40.0       NaN
3  hyderbad         36.0       NaN
0     delhi          NaN      68.0
1    mumbai          NaN      65.0
2  banglore          NaN      75.0
3    chenai          NaN      70.0

In [84]:
pd.concat([df1,df2],axis=1)

       city  temparature      city  humidity
0    mumbai           32     delhi        68
1     delhi           45    mumbai        65
2  banglore           40  banglore        75
3  hyderbad           36    chenai        70

In [85]:
pd.concat([df1,df2],ignore_index=True)

       city  temparature  humidity
0    mumbai         32.0       NaN
1     delhi         45.0       NaN
2  banglore         40.0       NaN
3  hyderbad         36.0       NaN
4     delhi          NaN      68.0
5    mumbai          NaN      65.0
6  banglore          NaN      75.0
7    chenai          NaN      70.0

**Merging of DataFrame**

In [87]:
#left join
left_df=pd.merge(df1,df2, on='city', how='left')
left_df

       city  temparature  humidity
0    mumbai           32      65.0
1     delhi           45      68.0
2  banglore           40      75.0
3  hyderbad           36       NaN

In [88]:
#right join
right_df=pd.merge(df1,df2, on='city', how='right')
right_df

       city  temparature  humidity
0     delhi         45.0        68
1    mumbai         32.0        65
2  banglore         40.0        75
3    chenai          NaN        70

In [89]:
#inner join
inner_df=pd.merge(df1,df2, on='city', how='inner')
inner_df

       city  temparature  humidity
0    mumbai           32        65
1     delhi           45        68
2  banglore           40        75

In [90]:
#outer join
outer_df=pd.merge(df1,df2, on='city', how='outer')
outer_df

       city  temparature  humidity
0  banglore         40.0      75.0
1    chenai          NaN      70.0
2     delhi         45.0      68.0
3  hyderbad         36.0       NaN
4    mumbai         32.0      65.0